src/Reports/ВедомостьАмортизацииГруппОСНалоговыйУчет/ВедомостьАмортизацииГруппОСНалоговыйУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ВедомостьАмортизацииГруппОСНалоговыйУчет</name>
  <attributes>
    <name>ОбщийОтчет</name>
    <type>
      <types>ReportObject.ОтчетСписокКроссТаблица</types>
    </type>
  </attributes>
</mdclass:Report>

src/AccountingRegisters/Налоговый/Налоговый.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Налоговый</name>
  <comment>(Регл)</comment>
  <chartOfAccounts>ChartOfAccounts.Налоговый</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Налоговый.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Налоговый.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Налоговый.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Налоговый.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Налоговый.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Налоговый.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>НомерЖурнала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеПартий</name>
    <comment>Запись сформирована при списании партий</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <comment>Дата формирования проводки регламентной процедурой</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРегламентнойОперации</name>
    <type>
      <types>EnumRef.ВидыРегламентныхОпераций</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

src/InformationRegisters/ПервоначальныеСведенияОСНалоговыйУчет/ПервоначальныеСведенияОСНалоговыйУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПервоначальныеСведенияОСНалоговыйУчет</name>
  <comment>(Регл)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПервоначальнаяСтоимостьНУ</name>
    <comment>Первоначальная стоимость для НУ (на 01.01.2002 или на момент ввода в эксплуатацию)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НалоговаяГруппаОС</name>
    <type>
      <types>CatalogRef.НалоговыеГруппыОсновныхСредств</types>
    </type>
  </resources>
  <resources>
    <name>УДАЛИТЬУчитываетсяКакЗапасНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокВключенияСтоимостиВСоставРасходов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НалоговыеНазначенияОС/НалоговыеНазначенияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НалоговыеНазначенияОС</name>
  <comment>(Регл)</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НалоговоеНазначение</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СостоянияОС/СостоянияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОС</name>
  <comment>Состояния ОС</comment>
  <enumValues>
    <name>ПринятоКУчету</name>
    <comment>Принято к учету</comment>
  </enumValues>
  <enumValues>
    <name>ВведеноВЭксплуатацию</name>
    <comment>Введено в эксплуатацию</comment>
  </enumValues>
  <enumValues>
    <name>СнятоСУчета</name>
    <comment>Снято с учета</comment>
  </enumValues>
</mdclass:Enum>

src/ChartsOfAccounts/Налоговый/Налоговый.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Налоговый</name>
  <comment>(Регл)</comment>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконтоХозрасчетные</extDimensionTypes>
  <predefined>
    <items>
      <name>ВаловыеДоходы</name>
      <description>Валовые доходы</description>
      <code>ВД</code>
      <accountType>Passive</accountType>
      <offBalance>true</offBalance>
    </items>
    <items>
      <name>ВаловыеРасходы</name>
      <description>Валовые расходы</description>
      <code>ВР</code>
      <offBalance>true</offBalance>
    </items>
    <items>
      <name>БалансоваяСтоимостьВалюты</name>
      <description>Балансовая стоимость валюты</description>
      <code>ВЛ</code>
      <offBalance>true</offBalance>
      <childItems>
        <name>БалансоваяСтоимостьБезналичнойВалюты</name>
        <description>Балансовая стоимость безналичной валюты</description>
        <code>ВЛБ</code>
        <offBalance>true</offBalance>
      </childItems>
      <childItems>
        <name>БалансоваяСтоимостьНаличнойВалюты</name>
        <description>Балансовая стоимость наличной валюты</description>
        <code>ВЛН</code>
        <offBalance>true</offBalance>
      </childItems>
    </items>
    <items>
      <name>ВзаиморасчетыСПодотчетнымиЛицамиВВалюте</name>
      <description>Взаиморасчеты с подотчетными лицами в валюте</description>
      <code>ВП</code>
      <accountType>ActivePassive</accountType>
      <offBalance>true</offBalance>
    </items>
    <items>
      <name>ЗапасыИОборудование</name>
      <description>Запасы и оборудование</description>
      <code>ЗО</code>
      <offBalance>true</offBalance>
      <childItems>
        <name>Запасы</name>
        <description>Запасы</description>
        <code>ЗА</code>
        <offBalance>true</offBalance>
        <childItems>
          <name>ТЗРЗапасы</name>
          <description>Транспортно - заготовительные расходы Запасы</description>
          <code>ТЗРЗА</code>
          <offBalance>true</offBalance>
        </childItems>
      </childItems>
      <childItems>
        <name>Оборудование</name>
        <description>Оборудование</description>
        <code>ОБ</code>
        <offBalance>true</offBalance>
      </childItems>
      <childItems>
        <name>ТоварыПереданные</name>
        <description>Товары переданные</description>
        <code>ТП</code>
        <offBalance>true</offBalance>
      </childItems>
    </items>
    <items>
      <name>НематериальныеАктивы</name>
      <description>Нематериальные активы</description>
      <code>НА</code>
      <offBalance>true</offBalance>
      <childItems>
        <name>АмортизацияНМА</name>
        <description>Амортизация НМА</description>
        <code>НАА</code>
        <accountType>Passive</accountType>
        <offBalance>true</offBalance>
      </childItems>
      <childItems>
        <name>НепринятыеКУчетуНМА</name>
        <description>Непринятые к учету НМА</description>
        <code>НАН</code>
        <offBalance>true</offBalance>
      </childItems>
      <childItems>
        <name>ПервоначальнаяСтоимостьНМА</name>
        <description>Первоначальная стоимость НМА</description>
        <code>НАП</code>
        <offBalance>true</offBalance>
      </childItems>
    </items>
    <items>
      <name>ОсновныеСредства</name>
      <description>Основные средства</description>
      <code>ОС</code>
      <offBalance>true</offBalance>
      <childItems>
        <name>МодернизацияИУлучшениеОбъектовОсновныхСредств</name>
        <description>Модернизация и улучшение объектов основных средств</description>
        <code>ОМО</code>
        <offBalance>true</offBalance>
      </childItems>
      <childItems>
        <name>МодернизацияИУлучшениеГруппОсновныхСредств</name>
        <description>Модернизация и улучшение групп основных средств</description>
        <code>ОМГ</code>
        <offBalance>true</offBalance>
      </childItems>
      <childItems>
        <name>ОсновныеСредстваУчетПоГруппам</name>
        <description>Основные средства учет по группам</description>
        <code>ОСГ</code>
        <offBalance>true</offBalance>
      </childItems>
      <childItems>
        <name>НепроизводственныеОсновныеСредства</name>
        <description>Непроизводственные основные средства</description>
        <code>ОСН</code>
        <offBalance>true</offBalance>
      </childItems>
      <childItems>
        <name>ОсновныеСредстваУчетПоОбъектам</name>
        <description>Основные средства учет по объектам</description>
        <code>ОСО</code>
        <offBalance>true</offBalance>
      </childItems>
      <childItems>
        <name>ОсновныеСредстваВыведенныеИзЭксплуатации</name>
        <description>Основные средства, выведенные из эксплуатации</description>
        <code>ОСВ</code>
        <offBalance>true</offBalance>
      </childItems>
    </items>
  </predefined>
  <attributes>
    <name>ЗапретитьИспользоватьВПроводках</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
  <extDimensionAccountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
  <extDimensionAccountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

src/Reports/ВедомостьАмортизацииГруппОСНалоговыйУчет/ObjectModule.bsl
#Если Клиент Тогда
// Настройка периода
Перем НП Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ 
// 

Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь) Экспорт

	// не выводим общие
	ОбщийОтчет.мСтруктураНевыводимыхГруппировок.Вставить("Общие", 1);

	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "ДатаНач"              , ОбщийОтчет.ДатаНач);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "ДатаКон"              , КонецДня(ОбщийОтчет.ДатаКон));
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "СостояниеВвода"       , Перечисления.СостоянияОС.ВведеноВЭксплуатацию);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "СостояниеСнятияСУчета", Перечисления.СостоянияОС.СнятоСУчета);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "СчетУчета"            , ПланыСчетов.Налоговый.ОсновныеСредстваУчетПоГруппам);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "СчетВР"               , ПланыСчетов.Налоговый.ВаловыеРасходы); 
	
	ОбщийОтчет.ВыводитьДополнительныеПоляВОтдельнойКолонке = Истина;
	
	ОбщийОтчет.СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок);

КонецПроцедуры // СформироватьОтчет()

// Процедура - заполняет начальные настройки отчета
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ПостроительОтчета = ОбщийОтчет.ПостроительОтчета;
	
	Текст = 
	"ВЫБРАТЬ
	|	Стоимость.Организация                                   КАК Организация,
	|	ПРЕДСТАВЛЕНИЕ(Стоимость.Организация),
	|	Стоимость.Субконто1                                     КАК ВидНалоговойДеятельности,
	|	ПРЕДСТАВЛЕНИЕ(Стоимость.Субконто1)                      КАК ВидНалоговойДеятельностиПредставление,
	|	Стоимость.Субконто3                                     КАК НалоговаяГруппаОС,
	|	ПРЕДСТАВЛЕНИЕ(Стоимость.Субконто3)                      КАК НалоговаяГруппаОСПредставление,
	|	СУММА(ПервоначальныеСведения.ПервоначальнаяСтоимостьНУ) КАК ПервоначальнаяСтоимость,
	|	СУММА(Стоимость.СуммаНачальныйОстаток)                  КАК СтоимостьНачальныйОстаток,
	|	СУММА(Стоимость.СуммаОборотДт)                          КАК СтоимостьОборотДт,
	|	СУММА(Стоимость.СуммаОборотКт)                          КАК СтоимостьСАмортизациейОборотКт,
	|	СУММА(Стоимость.СуммаОборот)                            КАК СтоимостьСАмортизациейОборот,
	|	СУММА(Стоимость.СуммаКонечныйОстаток)                   КАК СтоимостьКонечныйОстаток,
	|	СУММА(Амортизация.СуммаОборот)                          КАК АмортизацияОборот,
	|	СУММА(Стоимость.СуммаОборот) 
	|		- ЕСТЬNULL(СУММА(Амортизация.СуммаОборот), 0)       КАК СтоимостьОборот,
	|	СУММА(Стоимость.СуммаОборотКт) 
	|		- ЕСТЬNULL(СУММА(Амортизация.СуммаОборот), 0)       КАК СтоимостьОборотКт
	|{ВЫБРАТЬ
	|	Организация.*,
	|	ВидНалоговойДеятельности.*,
	|	НалоговаяГруппаОС.*}
	|ИЗ
	|	РегистрБухгалтерии.Налоговый.ОстаткиИОбороты(&ДатаНач, &ДатаКон, , ,
	|	                   Счет = &СчетУчета, , {Субконто3 КАК НалоговаяГруппаОС,
	|	                   Организация.* КАК Организация, Субконто3 КАК ВидНалоговойДеятельности}) КАК Стоимость
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			(ВЫБРАТЬ
	|				ПервоначальныеСведения.Организация                      КАК Организация,
	|				НалоговыеНазначенияОС.НалоговоеНазначение.ВидНалоговойДеятельности      КАК ВидНалоговойДеятельности,
	|				ПервоначальныеСведения.НалоговаяГруппаОС                КАК НалоговаяГруппаОС,
	|				СУММА(ПервоначальныеСведения.ПервоначальнаяСтоимостьНУ) КАК ПервоначальнаяСтоимостьНУ
	|			ИЗ
	|				РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет.СрезПоследних(&ДатаКон, 
	|				                {НалоговаяГруппаОС, Организация.* КАК Организация}) КАК ПервоначальныеСведения
	|					ЛЕВОЕ СОЕДИНЕНИЕ 
	|						РегистрСведений.НалоговыеНазначенияОС.СрезПоследних(
	|						                &ДатаКон, {Организация.* КАК Организация}) КАК НалоговыеНазначенияОС
	|					ПО ПервоначальныеСведения.Организация = НалоговыеНазначенияОС.Организация
	|						И ПервоначальныеСведения.ОсновноеСредство = НалоговыеНазначенияОС.ОсновноеСредство
	|		
	|			СГРУППИРОВАТЬ ПО
	|				ПервоначальныеСведения.Организация,
	|				НалоговыеНазначенияОС.НалоговоеНазначение.ВидНалоговойДеятельности,
	|				ПервоначальныеСведения.НалоговаяГруппаОС) КАК ПервоначальныеСведения
	|		ПО Стоимость.Организация = ПервоначальныеСведения.Организация
	|			И Стоимость.Субконто1 = ПервоначальныеСведения.ВидНалоговойДеятельности
	|			И Стоимость.Субконто3 = ПервоначальныеСведения.НалоговаяГруппаОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Налоговый.ОборотыДтКт(&ДатаНач, &ДатаКон, ,
	|			                   СчетДт = &СчетВР, , СчетКт = &СчетУчета, , 
	|			                   {СубконтоКт3 КАК НалоговаяГруппаОС, 
	|			                   Организация.* КАК Организация}) КАК Амортизация
	|		ПО Стоимость.Организация = Амортизация.Организация
	|			И Стоимость.Субконто1 = Амортизация.СубконтоКт1
	|			И Стоимость.Субконто3 = Амортизация.СубконтоКт3
	|
	|СГРУППИРОВАТЬ ПО
	|	Стоимость.Организация,
	|	Стоимость.Субконто1,
	|	Стоимость.Субконто3
	|{УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ВидНалоговойДеятельности,
	|	НалоговаяГруппаОС,
	|	ПервоначальнаяСтоимость,
	|	СтоимостьНачальныйОстаток,
	|	СтоимостьОборотДт,
	|	СтоимостьСАмортизациейОборотКт,
	|	СтоимостьСАмортизациейОборот,
	|	СтоимостьКонечныйОстаток,
	|	АмортизацияОборот,
	|	СтоимостьОборот,
	|	СтоимостьОборотКт}
	|ИТОГИ
	|	СУММА(ПервоначальнаяСтоимость),
	|	СУММА(СтоимостьНачальныйОстаток),
	|	СУММА(СтоимостьОборотДт),
	|	СУММА(СтоимостьСАмортизациейОборотКт),
	|	СУММА(СтоимостьСАмортизациейОборот),
	|	СУММА(СтоимостьКонечныйОстаток),
	|	СУММА(АмортизацияОборот),
	|	СУММА(СтоимостьОборот),
	|	СУММА(СтоимостьОборотКт)
	|ПО
	|	ОБЩИЕ,
	|	Организация,
	|	ВидНалоговойДеятельности
	|{ИТОГИ ПО
	|	Организация,
	|	ВидНалоговойДеятельности,
	|	НалоговаяГруппаОС}
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	СтруктураПредставлениеПолей = Новый Структура;
	СтруктураПредставлениеПолей.Вставить( "ВидНалоговойДеятельности", "Вид налоговой деятельности");
	СтруктураПредставлениеПолей.Вставить( "НалоговаяГруппаОС",        "Налоговая группа");
	
	СтруктураПредставлениеПолей.Вставить( "ПервоначальнаяСтоимость",        "Первоначальная стоимость");
	СтруктураПредставлениеПолей.Вставить( "СтоимостьНачальныйОстаток",      "Стоимость на начало периода");
	СтруктураПредставлениеПолей.Вставить( "СтоимостьОборотДт",              "Стоимость (приход)");
	СтруктураПредставлениеПолей.Вставить( "СтоимостьСАмортизациейОборотКт", "Стоимость с Аморт.(расход)");
	СтруктураПредставлениеПолей.Вставить( "СтоимостьСАмортизациейОборот",   "Изменение стоимости ОС с уч. аморт.");
	СтруктураПредставлениеПолей.Вставить( "АмортизацияОборот",              "Амортизация за период");
	СтруктураПредставлениеПолей.Вставить( "СтоимостьОборотКт",              "Стоимость (расход)");
	СтруктураПредставлениеПолей.Вставить( "СтоимостьОборот",                "Изменение стоимости");
	СтруктураПредставлениеПолей.Вставить( "СтоимостьКонечныйОстаток",       "Стоимость на конец периода");
	
	ПостроительОтчета.Текст = Текст;
		
	УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
	УправлениеОтчетами.ОчиститьДополнительныеПоляПостроителя(ПостроительОтчета);
	
	ОбщийОтчет.ЗаполнитьПоказатели( "ПервоначальнаяСтоимость",        "Первоначальная стоимость",            Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьНачальныйОстаток",      "Стоимость на начало периода",         Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьОборотДт",              "Стоимость (приход)",                  Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьСАмортизациейОборотКт", "Стоимость с Аморт.(расход)",          Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьСАмортизациейОборот",   "Изменение стоимости ОС с уч. аморт.", Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "АмортизацияОборот",              "Амортизация за период",               Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьОборотКт",              "Стоимость (расход)",                  Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьОборот",                "Изменение стоимости",                 Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьКонечныйОстаток",       "Стоимость на конец периода",          Истина, "ЧЦ=15; ЧДЦ=2");
	
	
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить("Организация");
	МассивОтбора.Добавить("НалоговаяГруппаОС");
	
	УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
	
	ОбщийОтчет.ВыводитьПоказателиВСтроку = Истина;
	ОбщийОтчет.РаскрашиватьИзмерения     = Истина;
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

// Читает свойство Построитель отчета
//
// Параметры
//	Нет
//
Функция ПолучитьПостроительОтчета() Экспорт

	Возврат ОбщийОтчет.ПолучитьПостроительОтчета();

КонецФункции // ПолучитьПостроительОтчета()

// Настраивает отчет по переданной структуре параметров
//
// Параметры:
//	Нет.
//
Процедура Настроить(Параметры) Экспорт

	ОбщийОтчет.Настроить(Параметры, ЭтотОбъект);

КонецПроцедуры // Настроить()

// Возвращает основную форму отчета, связанную с данным экземпляром отчета
//
// Параметры
//	Нет
//
Функция ПолучитьОсновнуюФорму() Экспорт
	
	ОснФорма = ПолучитьФорму();
	ОснФорма.ОбщийОтчет = ОбщийОтчет;
	ОснФорма.ЭтотОтчет  = ЭтотОбъект;
	
	Возврат ОснФорма;
	
КонецФункции // ПолучитьОсновнуюФорму()

// Возвращает форму настройки 
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	
//
Функция ПолучитьФормуНастройки() Экспорт
	
	ФормаНастройки = ОбщийОтчет.ПолучитьФорму("ФормаНастройка");
	Возврат ФормаНастройки;
	
КонецФункции // ПолучитьФормуНастройки()

// Процедура обработки расшифровки
//
// Параметры:
//	Нет.
//
Процедура ОбработкаРасшифровки(РасшифровкаСтроки, ПолеТД, ВысотаЗаголовка, СтандартнаяОбработка) Экспорт
	
	// Добавление расшифровки из колонки
	Если ТипЗнч(РасшифровкаСтроки) = Тип("Структура") Тогда
		
		// Расшифровка колонки находится в заголовке колонки
		РасшифровкаКолонки = ПолеТД.Область(ВысотаЗаголовка+2, ПолеТД.ТекущаяОбласть.Лево).Расшифровка;

		Расшифровка = Новый Структура;

		Для каждого Элемент Из РасшифровкаСтроки Цикл
			Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;

		Если ТипЗнч(РасшифровкаКолонки) = Тип("Структура") Тогда

			Для каждого Элемент Из РасшифровкаКолонки Цикл
				Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
			КонецЦикла;

		КонецЕсли; 

		ОбщийОтчет.ОбработкаРасшифровкиСтандартногоОтчета(Расшифровка, СтандартнаяОбработка, ЭтотОбъект);

	КонецЕсли;
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру, в которую складываются настройки
//
Функция СформироватьСтруктуруДляСохраненияНастроек(ПоказыватьЗаголовок) Экспорт
	
	СтруктураНастроек = Новый Структура;
	
	ОбщийОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураНастроек, ПоказыватьЗаголовок);
	
	Возврат СтруктураНастроек;
	
КонецФункции

// Заполняет настройки из структуры - кроме состояния панели "Отбор"
//
Процедура ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет=Неопределено) Экспорт
	
	// Если отчет, вызвавший процедуру, не передан, то считаем, что ее вызвал этот отчет
	Если Отчет = Неопределено Тогда
		Отчет = ЭтотОбъект;
	КонецЕсли;

	ОбщийОтчет.ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет);
	
КонецПроцедуры

ОбщийОтчет.ИмяРегистра = "Налоговый";
ОбщийОтчет.мНазваниеОтчета = "Ведомость амортизации групп ОС (налоговый учет)";
ОбщийОтчет.мВыбиратьИмяРегистра = Ложь;
ОбщийОтчет.мРежимВводаПериода = 0;
ОбщийОтчет.мВыбиратьИспользованиеСвойств = Ложь;

#КонецЕсли
